const axios = require('axios');
const { MessageEmbed } = require('discord.js');

module.exports.run = async (client, message, args) => {
    const url = "https://some-random-api.ml/img/dog";
    const facts = "https://some-random-api.ml/facts/dog"
    user = message.author;


    let replies = [
        'تخمین زده میشود در ایالات متحده حدود یک میلیون سگ بعنوان وارث اول صاحبان خود ثبت شده اند تا بعد از مرگ صاحبشان اموال او را به ارث ببرند.'
        ,'در باور عموم سگها رنگها را نمی بینند و دید سیاه و سفید دارند. در صورتیکه این درست نیست و  مشخص شده سگها رنگها را تشخیص میدهند. البته تشخیص رنگ آنها شبیه ما نیست ولی سگها قادر به تمایز رنگهای آبی، زرد و خاکستری هستند. سگها احتمالا رنگ قرمز و سبز را نمی بینند. این مثل  حالتی است  که ما در هنگام غروب داریم.'
        ,'از نظر تاریخی داشهوندها یکی از قدیمی ترین نژادهای سگ  هستند که به دوره مصر باستان بر میگردد. نام داشهوند ها به زمان شکار گورکن ها بر میگردد. در زمان آلمانی  داش  به معنی گورکن و هوند به معنی سگ است.'
        ,'سگ ها قادرند تا  ۲۵۰ کلمه  و حرکت را درک کنند، همچنین می توانند محاسبات ساده ریاضی را انجام دهند.  به طور میانگین هوش یک سگ به اندازه یک کودک دو ساله است.'
        ,'بعضی از سگ ها مانند سگ های ولگرد روسیه این را فهمیده اند که چگونه با استفاده از سیستم مترو به منظور سفر به مناطق بیشتری در جستجوی غذا بروند.'
        ,'سگ ها به اندازه انسانها و سایر پستانداران از آغوش گرفتن لذت نمی برند.در واقع حیوان آنرا نشانه ای از تسلط تفسیر می کند.'
        ,'در سال ۲۰۰۳، دکتر Roger Mugford، Wagometer را اختراع کرد؛ وسیله‌ای که ادعا می‌شود می‌تواند مود و حالت دقیق سگ را با اندازه گیری تکان خوردن‌های دم او مشخص کند.        '
        ,'سگ‌ها در بین پنجه‌های خود غدد عرقی دارند.'
        ,'سیب و گلابی هم حاوی آرسنیک هستند و ممکن است برای سگ‌ها کشنده باشند.'
        ,'مقادیر کمی انگور و کشمش می‌تواند باعث نارسایی کلیوی در سگ‌ها شود. شکلات، پیاز پخته شده یا هر چیز دیگری که حاوی کافئین باشد می‌تواند برای سگ‌ها مضر باشد.'
        ,'مصریان باستان بسیار سگ‌ها را مورد احترام قرار می‌دادند. هنگامی که یک سگ خانگی می‌مرد، صاحبان آن ابروهای خود را می‌تراشیدند،‌ موهای خود را گل آلود می‌کردند و روزها با صدای بلند سوگواری می‌کردند.'
        ,'سگ‌ها سه پلک چشم دارند. پلک سوم چشم را مرطوب نگه می‌دارد و از آن محافظت می‌کند.'
        ,'بیشترین تعداد سگی که تابحال یک نفر داشته ۵ هزار عدد بوده است.'
        ,'توله سگ‌ها گاهی اوقات اگر توسط سزارین به دنیا بیایند و قبل از اینکه به مادرشان داده شوند تمیز شوند، توسط مادرشان پذیرفته نمی‌شوند.'
        ,'شکل صورت یک سگ نشان می‌دهد که او چقدر زندگی می‌کند. سگ‌هایی که صورت‌های تیز و خشن دارند و بیشتر شبیه گرگ‌ها هستند بیشتر زندگی می‌کنند و آنهایی که صورت‌هایی صاف و ملوس دارند کم‌تر عمر می‌کنند.'
        ,'فلاطون یک بار گفت: روحی از یک فیلسوف در یک سگ وجود دارد.'
        ,'اولین سگ‌ها، گرگ‌های خود اهلی شده‌ای بودند که حداقل ۱۲ هزار سال پیش جذب مسکن‌های دائمی انسان‌ها شدند.'
        ,'گفته می‌شود که اسکندر مقدونی به یادبود سگش شهری را تأسیس و نامگذاری کرده است'
        ,'سگ‌های خالدار در هنگام تولد کاملاً سفید هستند.'
        ,'در دنیا سالی ۵ میلیون جراحت بر اثر گاز گرفتن سگ‌ها به وجود می‌آید و اکثر قربانی‌ها هم کودکان هستند.'
        ,'یک بررسی نشان می‌دهد که ۳۳٪ از کسانی که سگ دارند وقتی از خانه خارج یا در مسافرت هستند برای سگ‌هایشان پیغام‌های تلفنی می‌گذارند!        '
        ,'یک بررسی نشان می‌دهد که ۳۳٪ از کسانی که سگ دارند وقتی از خانه خارج یا در مسافرت هستند برای سگ‌هایشان پیغام‌های تلفنی می‌گذارند!        '
        ,'بینی سگ‌ها مرطوب است تا بتوانند قطرات شیمیایی بوها را در هوا بیشتر جمع و جذب کنند.        '
        ,' بیشتر کارشناسان بر این باورند که انسان‌ها سگ‌ها را قبل از الاغ‌ها، اسب‌ها، گوسفندها، بزها، گربه‌ها و مرغ‌ها اهلی کرده‌اند'
        ,'سگی که بیشترین عمر را داشته یک سگ استرالیایی بوده که ۲۹ سال و ۵ ماه زندگی کرده است. به حساب عمر انسان‌ها می‌شود حدود ۱۶۰ سال.'
        ,'یک سگ ماده و توله سگ ماده‌اش می‌توانند در طی حدود ۷ سال  ۴۳۷۲ سگ به دنیا بیاورند.'
        ,'سگ‌ها ۱۴ هزار سال و گربه‌ها ۷ هزار سال است که با انسان‌ها زندگی می‌کنند.        '
        ,'سگ‌ها می‌توانند رنگ‌ها را ببینند، هرچند به احتمال زیاد آنها رنگ‌ها را شبیه به انسان‌های کور رنگ می‌بینند. سگ‌ها زمانی که نور کم است بهتر می‌توانند ببینند.'
        ,'سگ‌ها دستورات کلامی را اگر با ایماو اشاره باشد راحت‌تر یاد می‌گیرند.'
        ,'ثر بینی سگ‌ها مثل اثر انگشت انسان‌ها خاص و منحصر به فرد است.'
        ,'آمریکا و فرانسه به ترتیب بیشترین تعداد سگ را در دنیا دارند.'
  ]

    let image, response;
    let fact, responses;
    try {
        response = await axios.get(url);
        image = response.data;

        responses = await axios.get(facts)
        fact = responses.data

    } catch (e) {
        return message.channel.send(`An error occured, please try again!`)
    }
 let result = Math.floor((Math.random() * replies.length));
        let amount = Math.floor(Math.random() * 1000000000000000) + 1;
    const embed = new MessageEmbed()
    .setTitle(`عکس رندوم به همراه یک دانستی درباره سگ ها`)
        .setColor(`#33908b`)
        .setDescription(`${replies[result]}`)
        .setImage(image.link)
        .setFooter('درخواست شده توسط' + message.member.displayName,  message.author.displayAvatarURL({ dynamic: true }))

    await message.channel.send(embed)
    }

    module.exports.help = {
        name:"dog",
        aliases: ["dogs"]
      }